let result = "5" + 3;
console.log(result);

// агар яке аз операнди мо стринг бошад ва дигар ракам бошад  дар амалиети бо + он конккатенсия мешавад "53" нишон медихад

let Subtracting = 10 - "4";
console.log(result);
// агар яке аз операнди мо стринг бошад ва дигар ракам бошад  дар амалиети бо - кор мекунад аз 10 4 ро минус мекунад чавоб 6

let Multiplying = "5" * 2;
console.log(result);

// агар яке аз операнди мо стринг бошад ва дигар ракам бошад  дар амалиети бо * кор мекунад аз 5*2 баробари 10

let Divide = "10" / 2;
console.log(result); // Вывод: 5

// агар яке аз операнди мо стринг бошад ва дигар ракам бошад  дар амалиети бо / кор мекунад аз 10/2 баробари 5

let Comparison = "5" == 5;
console.log(result);
// агар яке аз операнди мо стринг бошад ва дигар ракам бошад дар вакти санчиш бо == чавоб true мешавад барои ки Javascript стрингро ракам мекунад месанчад ва == танхо тут не строгая сравнения толька значения сравнивается

let ComparisonThree = "5" === 5;
console.log(result);
// агар яке аз операнди мо стринг бошад ва дигар ракам бошад дар вакти санчиш бо === чавоб false мешавад барои ки дар инхолат хам значения хам типиро месанчад

let CompareString = "" == 0;
console.log(result);
// агар яке аз операнди мо стринг холи бошад ва дигар ракам бошад дар вакти санчиш бо == чавоб true мешавад барои ки Javascript типи стрингро ба типи  ракам мекунад чихели ки мо медонем стринги холи ба 0 баробар аст ва агар мо ба  == санчем 0 = 0 true мешавад тут не строгая сравнения толька значения сравнивается

let Concatenation = "The number is " + 10;
console.log(result);
// агар яке аз операнди мо стринг бошад ва дигар ракам бошад дар вакти  + чавоб "The number is 10" барои он ки дар инчо конкатенасия мешавад JavaScript ракамро гирифта ба типи стринг бармегардонад ва конкатенасия мешавад

let number = 123;
let stringNumber = number.toString();
console.log(stringNumber);
// дар инчо мо методро истифода мебарем ки типи ракамро ба стринг бармегардонад

// дар охир хамин ро фахмиди ки агар неявное преобразвание типов в javaScript нужно знат так как иногда могут бить ошибки каторый патом нужно найти если хорошо знаеш как это работает то не будет проблем
